Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/gpio.c
/* =============================================================================
 * Internal Helper Functions
 * =============================================================================
 */

/**
 * @brief Validate port and pin numbers against RX72N hardware limits
 *
 * @details
 * Performs validation of GPIO port and pin numbers before any register access.
 * This function is called by all public GPIO functions to ensure safe operation
 * and prevent out-of-bounds hardware register access.
 *
 * ## Validation Algorithm
 *
 * 1. Check port validity via rx_port_get_base() (returns NULL for invalid ports)
 * 2. Check pin number against k_rx_pin_max (maximum valid pin number per port)
 *
 * ## Port Validation
 *
 * Uses rx_port_get_base() which returns NULL for any port number that does not
 * correspond to a physical port on the RX72N. Valid port numbers are 0-9
 * (decimal) and 0xA-0x10 (hexadecimal, corresponding to ports A through G).
 * Passing an out-of-range port is safely caught here before any register
 * dereference occurs.
 *
 * ## Pin Validation
 *
 * Each RX72N GPIO port exposes up to 8 pins numbered 0 through 7. The
 * k_rx_pin_max constant defines the inclusive upper bound (7). A lower-bound
 * check against zero is omitted because pin is a uint8_t, making pin < 0
 * structurally impossible; omitting it avoids a -Wtype-limits compiler warning.
 *
 * ## Why Both Checks Are Required
 *
 * An invalid port with a valid pin, or a valid port with an invalid pin, must
 * both be rejected. Either condition alone would result in incorrect hardware
 * register access, undefined behavior, or corrupted peripheral state.
 *
 * @param[in] port  Port number in the RX72N hardware port range (0-9, 0xA-0x10).
 *                  Values outside this range cause k_rx_err_gpio_invalid_port.
 * @param[in] pin   Pin number within the port (valid range: 0 to k_rx_pin_max).
 *                  Values above k_rx_pin_max cause k_rx_err_gpio_invalid_pin.
 *
 * @return rx_err_t Validation result
 * @retval k_rx_ok Both port and pin are within valid hardware ranges
 * @retval k_rx_err_gpio_invalid_port port does not map to a physical RX72N port
 * @retval k_rx_err_gpio_invalid_pin  pin exceeds k_rx_pin_max (7)
 *
 * @pre port must be within the RX72N valid port range (0-9, 0xA-0x10);
 *      values outside this range are rejected before any register access
 * @pre pin must be within the valid pin range for the specified port (0 to
 *      k_rx_pin_max); values above k_rx_pin_max are rejected with an error
 * @post Returns k_rx_ok only when both port and pin are simultaneously valid;
 *       no partial-success return is possible
 * @post No hardware state is modified; this function is purely read-only with
 *       respect to peripheral registers and module-level variables
 *
 * @note Thread-safe: No shared mutable state accessed; safe to call concurrently
 * @note Performance: O(1), approximately 50 cycles at 240 MHz
 * @note An error log message is emitted for each failed validation to aid debugging
 *
 * @par Example:
 * @code
 * // Typical usage inside a GPIO public function
 * const uint8_t port    = rx_port_from_pin(pin);
 * const uint8_t pin_num = rx_pin_from_pin(pin);
 * rx_err_t err = internal_validate_port_pin(port, pin_num);
 * RX_RETURN_ON_ERROR(err, "GPIO", "Port/pin validation failed");
 * @endcode
 *
 * @see rx_port_get_base() Port lookup function used internally for port validation
 * @see k_rx_pin_max Maximum valid pin index (inclusive upper bound)
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] 2 preconditions, 2 postconditions
 */
static rx_err_t internal_validate_port_pin(const uint8_t port, const uint8_t pin)
{
  /* Validate port */
  const volatile rx_port_regs_t* port_base = rx_port_get_base(port);
  if (port_base == nullptr) {
    rx_log_error("GPIO", "Invalid port number");
    return k_rx_err_gpio_invalid_port;
  }

  /* Validate pin (lower bound check omitted - pin is uint8_t, k_rx_pin_min == 0,
   * so pin >= k_rx_pin_min is always true, avoiding -Wtype-limits warning) */
  if (pin > k_rx_pin_max) {
    rx_log_error("GPIO", "Invalid pin number");
    return k_rx_err_gpio_invalid_pin;
  }

  return k_rx_ok;
}

/* =============================================================================
 * Public API Implementation
 * =============================================================================
 */

/**
 * @brief Configure GPIO pin as digital output
 *
 * @details
 * Configures a GPIO pin for digital output mode. This function performs:
 * 1. Parameter validation (port and pin number)
 * 2. Pin reservation via the global pin validator (conflict detection)
 * 3. PMR register clear (select GPIO mode instead of peripheral function)
 * 4. PDR register set (configure as output direction)
 *
 * ## Register Operations
 *
 * ```
 * PMR &= ~(1 << pin)  // Clear bit: Select GPIO mode (not peripheral)
 * PDR |= (1 << pin)   // Set bit: Configure as output
 * ```
 *
 * ## Pin Reservation
 *
 * The function attempts to reserve the pin through rx_infrastructure_get_pin_interface().
 * If the pin is already reserved (k_rx_err_gpio_conflict), the function continues
 * without error - this allows reconfiguration of already-owned pins.
 *
 * ## Initial Output State
 *
 * This function does NOT set the initial output level. After calling gpio_set_output(),
 * call gpio_write_high() or gpio_write_low() to set the desired level.
 *
 * @param[in] pin Pin identifier encoded as rx_port_pin_t
 *                Use RX_PORT_PIN() macro: RX_PORT_PIN(port, pin_num)
 *                Example: RX_PORT_PIN(0xA, 5) for Port A, Pin 5
 *
 * @return rx_err_t Configuration result
 * @retval k_rx_ok Pin successfully configured as output
 * @retval k_rx_err_gpio_invalid_port Port number in pin is invalid
 * @retval k_rx_err_gpio_invalid_pin Pin number exceeds k_rx_pin_max
 * @retval k_rx_err_rtos_mutex Pin validator mutex error (rare)
 *
 * @pre Pin must be a valid GPIO-capable pin on RX72N
 * @pre System infrastructure should be initialized (for pin validation)
 *
 * @post Pin is configured as GPIO output
 * @post PMR bit for pin is cleared (GPIO mode)
 * @post PDR bit for pin is set (output direction)
 * @post Pin is reserved in validator (if available)
 *
 * @note Thread-safe: Pin reservation uses mutex, register writes are not atomic
 * @note Performance: ~1-2 us @ 240 MHz (includes reservation)
 * @note Idempotent: Safe to call multiple times on same pin
 *
 * @warning Output level is undefined after this call - set with gpio_write_*
 * @warning Do not call from ISR (pin reservation may block)
 *
 * @par Example:
 * @code
 * // Configure LED pin as output
 * rx_err_t err = gpio_set_output(RX_PORT_PIN(0, 3));  // Port 0, Pin 3
 * if (err != k_rx_ok) {
 *   rx_log_error("LED", "Failed to configure LED pin");
 *   return err;
 * }
 *
 * // Set initial state to low (LED off)
 * gpio_write_low(RX_PORT_PIN(0, 3));
 *
 * // Toggle LED
 * gpio_toggle(RX_PORT_PIN(0, 3));
 * @endcode
 *
 * @see gpio_set_input() Configure pin as input
 * @see gpio_write_high() Set output high after configuration
 * @see gpio_write_low() Set output low after configuration
 * @see RX_PORT_PIN() Macro to create rx_port_pin_t
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] 2 preconditions, 4 postconditions
 */
rx_err_t gpio_set_output(const rx_port_pin_t pin)
{
  /* Extract port and pin number from rx_port_pin_t */
  const uint8_t port    = rx_port_from_pin(pin);
  const uint8_t pin_num = rx_pin_from_pin(pin);

  /* Validate parameters */
  rx_err_t err = internal_validate_port_pin(port, pin_num);
  RX_RETURN_ON_ERROR(err, "GPIO", "Port/pin validation failed");

  /* Reserve pin through global pin validator */
  const rx_pin_interface_t* const pin_iface = rx_infrastructure_get_pin_interface();
  if (pin_iface != nullptr) {
    err = pin_iface->reserve_pin(pin_iface->ctx, port, pin_num, "GPIO_OUT");
    if (err != k_rx_ok && err != k_rx_err_gpio_conflict) {
      /* Allow conflict (pin already reserved), but fail on other errors */
      RX_RETURN_ON_ERROR(err, "GPIO", "Pin reservation failed");
    }
  }

  /* Get port base address */
  volatile rx_port_regs_t* port_base = rx_port_get_base(port);

